org/20220207141508-evil_is_never_intended_as_evil.org
:PROPERTIES:
:ID:       ae6ed6ef-98f0-452a-8319-30ce48053d9f
:END:
#+TITLE: Evil is never intended as evil
#+CREATED: [2022-02-07 Mon 14:15]
#+LAST_MODIFIED: [2022-02-07 Mon 14:23]

To do evil you need an absolute moral reference point that /justifies/ actions that would otherwise be comdemable. To do evil you need to do a /lesser/ evil. The notion of evil, once introduced, is indeed self-referential, and morally allows /more/ evil to exist. To break the spiral is to point out that evil is non essential (nothing and no one comes to existence evil) but a construction, like Hannah Arendt did.

Look at what has happened in the late 2010s-early 2020s with the social justice movement. Members who went too far where convinced that their targets were /evil/.

Qualifying someone as /evil/ is to deny their humanity.

#+begin_src quote
[T]he contradiction inherent to all evil is that it originates in the desire to eliminate evil.
-- James P. Carse, Finite and infinite games
#+end_src

[[cite:&carse2013]]
