20220207141508-evil_is_never_intended_as_evil.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-11 Wed 06:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Evil is never intended as evil</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Evil is never intended as evil</h1>
<p>
To do evil you need an absolute moral reference point that <i>justifies</i> actions that would otherwise be comdemable. To do evil you need to do a <i>lesser</i> evil. The notion of evil, once introduced, is indeed self-referential, and morally allows <i>more</i> evil to exist. To break the spiral is to point out that evil is non essential (nothing and no one comes to existence evil) but a construction, like Hannah Arendt did.
</p>

<p>
Look at what has happened in the late 2010s-early 2020s with the social justice movement. Members who went too far where convinced that their targets were <i>evil</i>.
</p>

<p>
Qualifying someone as <i>evil</i> is to deny their humanity.
</p>

<div class="org-src-container">
<pre class="src src-quote">[T]he contradiction inherent to all evil is that it originates in the desire to eliminate evil.
-- James P. Carse, Finite and infinite games
</pre>
</div>

<p>

</p>

<div id="outline-container-orgeeee043" class="outline-2">
<h2 id="orgeeee043">Links to this note</h2>
</div>
</div>
</body>
</html>